backend/widgets/UserBlock/UserBlock.php

SELECT * FROM "user" WHERE "id"=1
---
    public function run()
    {

        $model = \dektrium\user\models\User::findOne(Yii::$app->user->id);