backend/controllers/AdsSliderController.php

SELECT * FROM "ads_slider" WHERE "id"='1'
---
    protected function findModel($id)
    {
        if (($model = AdsSlider::findOne($id)) !== null) {