backend/controllers/PackageOptionsController.php

SELECT * FROM "tarif_options" WHERE "id"='1'
---
    protected function findModel($id)
    {
        if (($model = TarifOptions::findOne($id)) !== null) {