backend/controllers/PackagesController.php

    protected function findModel($id)
    {
        if (($model = TarifPackages::findOne($id)) !== null) {
---
SELECT * FROM "tarif_packages" WHERE "id"='1'