backend/config/main.php

        'taxonomy' => [
            'class' => 'common\modules\taxonomy\Module',
            'languages' => function () {
                $languages = \common\modules\language\models\Language::find()->all();
---
SELECT * FROM "language"