common/modules/store/classes/Url.php

SELECT * FROM "taxonomy_items" WHERE "transliteration" IN ('taxonomy', 'vocabulary')
---
    public function parseCatalog(){
        $chanks = explode('/', $this->_catalogPath);
        $this->_catalogTerms = TaxonomyItems::find()
                ->where([
                    'transliteration' => explode('/', $this->_catalogPath)
                ])
                ->all();