common/modules/taxonomy/models/TaxonomyVocabulary.php

SELECT COUNT(*) FROM "taxonomy_items" WHERE "vid"=1
---
    public function countTerms()
    {
        return (new \yii\db\Query())
            ->select('COUNT(*)')
            ->from(TaxonomyItems::TABLE_TAXONOMY_ITEMS)
            ->where(['vid' => $this->id])->scalar();