backend/views/packages/_form.php

    <?= $form->field($model, 'price')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'term')->textInput() ?>
    <?= $form->field($model, 'options')->checkboxList(
        ArrayHelper::map(
            TarifOptions::find()
                ->where(['status'=>true])
                ->orderBy(['weight'=>'asc'])
                ->all(),
            'id', 'name'));
---
SELECT * FROM "tarif_options" WHERE "status"=TRUE ORDER BY "weight"